{
    "basics": {
      "name": "Clarance Liberiste Ntwari",
      "label": "Software Engineer",
      "email": "contact@claranceliberi.me",
      "url": "https://www.claranceliberi.me",
      "picture": "https://res.cloudinary.com/dawr8i20o/image/upload/v1690972585/unshared/passports/IMG_8252_3-min_l3hutm.jpg",
      "summary": "I'm a curious and driven software engineer with over 4 years of experience crafting scalable solutions across diverse environments - from startups to large enterprises. I've led teams of up to 12 developers, implementing modern web technologies and DevOps practices that significantly improve development workflows and user experiences. My expertise spans the full stack, with a particular focus on TypeScript, Node.js, and cloud technologies, having delivered impactful solutions that reduced processing times from days to hours at RSSB, implemented high-performance microservices at PivotAccess, and contributed to BP's global fleet management platform. What drives me is the intersection of technical excellence and real-world impact, consistently approaching each challenge with relentless curiosity and a commitment to continuous growth while delivering tangible value to users through performant, scalable software solutions.",
      "location": {
        "city":"Kigali",
        "countryCode": "RW",
        "address": "Rwanda"
      },
      "profiles": [

        {
          "network": "GitHub",
          "username": "claranceliberi",
          "url": "https://github.com/claranceliberi"
        },
        {
          "network": "Twitter",
          "username": "claranceliberi",
          "url": "https://twitter.com/claranceliberi"
        },
        {
          "network": "LinkedIn",
          "username": "claranceliberi",
          "url":"https://www.linkedin.com/in/claranceliberi/"
        }
      ]
    },
    "work": [
      {
        "name": "Rwanda Social Security Board (RSSB) ",
        "position": "Software Engineer",
        "startDate": "2024-01-30",
        "endDate": "2024-11-20",
        "highlights": [
          "Developed a platform to reimburse maternity leave benefits. The app streamlined the application-to-approval process from 7 days to 1 hour.",
          "I digitalized pension applications, reducing paperwork from 4 documents to 1 and eliminating office visits by moving the entire process online. Applications now take 10 minutes vs 5 days previously, while the approval workflow was streamlined from 6 to 3 people, bringing approval time from 7 days to 1 day."
        ],
        "summary": "",
        "url": "https://www.rssb.rw/",
        "location": "Kigali City, Rwanda "
      },
      {
        "name": "Pivot Access ",
        "position": "Full Stack Engineer",
        "startDate": "2023-05-01",
        "endDate": "2024-01-01",
        "highlights": [
          "Led a team of 12 developers, emphasizing code reviews and adherence to best coding practices to maintain high code quality. Implemented a CI/CD pipeline using GitLab, pnpm, Docker, and Kubernetes, slashing the time required for linting, testing, and deploying multiple micro frontends.",
          "Created the Tekana Components library, crafted with Typescript, and ensured its availability on npm and storybook for widespread use by various frontend teams.",
          "Developed comprehensive CI/CD pipeline flow charts and frontend project documentation, simplifying the onboarding process for new team members.",
          "Guided the implementation of Atomic Design principles, fortifying consistency and scalability within the component library.",
          "Worked on User microservice written in Spring boot, enabling Authentication and Authorization with Role Based Access, and Wrote high performant SQL queries to write aggregated reports in Postgres DB",
          "Implemented User activity and Access Audit log on User microservice and Audit logs microservice",
          "Worked on Report and analytics microservice using Clickhouse DB, configured Clickhouse to sync reports from other 19 Postgres DB replicas, and then wrote high performant queries to retrieve analytics."
        ],
        "summary": "I played a key role in the development of 'Tekana', a platform designed to manage the Rwanda National Police's daily operations, including traffic fines, driving license examinations, Moto Vehicle Inspection and license provisioning. Subsequently, as a seasoned Fullstack Engineer at Pivot Access here is what I did:",
        "url": "https://www.pivotaccess.com/",
        "location": "Kigali City, Rwanda "
      },
      {
        "name": "British Petroleum (BP) ",
        "position": "Senior Fullstack Engineer",
        "startDate": "2022-07-01",
        "endDate": "2023-03-01",
        "highlights": [
          "I contributed to the Notification Team (Squad) using Node.js and Postgres, ensuring that Superfleet users may improve their platform experiences by not missing any action or insight made on the platform.",
          "I was a part of the Audit Trail Team, whose job it was to keep a log of all the platform's users' past actions. I wrote performant SQL queries to retrieve millions of audits in Postgres.",
          "Created different components under the Atomic Design principle and Storybook while making the BP design system, reducing component dependency by 35%.",
          "Wrote Regression and Unit tests of the components in the BP design System.",
          "Involvement in Domains Team, managing high-level monorepo architecture with NX for efficient team development and CI/CD pipelines."
        ],
        "summary": "By simplifying end-to-end fleet management and offering guidance on how to decarbonize their fleet, a one-stop digital platform operating on BP's Superfleet platform assists fleet managers who want to maximize the efficiency of their fleet. This frees up time to expand their business in a Net Zero world. ​",
        "url": "https://www.bp.com/",
        "location": "London, England, United Kingdom "
      },
      {
        "name": "HuntersOfBook",
        "position": "Software Full Stack Engineer",
        "startDate": "2021-04-30",
        "endDate": "2022-06-30",
        "highlights": [
          "Created Component presentation with storybook, which improved Developer experience by 15%.",
          "Wrote unit test and integration test respecting TDD with Jest and testing-library",
          "Built end-to-end APIs using Nest.js, PostgreSQL, Prisma, and Graphql.",
          "Developed a powerful WYSIWYG editor using Vue.js, an editor that made content writing smooth and faster with a 45% increase in efficiency for users.",
          "Wrote GitHub Action scripts for PRs, automating PR validations and automatic deployment, speeding up the normal manual process from 15mins to 55 secs."
        ],
        "summary": "Improved frontend development and user engagement at HuntersOfBook through storybook UI components and WYSIWYG editor.",
        "location": "Istanbul, Turkey "
      },
      {
        "name": "Kurious ltd",
        "position": "Frontend Engineer",
        "startDate": "2020-07-31",
        "endDate": "2021-03-31",
        "highlights": [
          "Developed and led software analysis and design process, resulting in the successful creation of over 20 Software Requirement Specification (SRS) documents, data dictionaries, DFD diagrams, and user use cases.",
          "Setup Gitlab Enterprise server, Jenkins, Tomcat, PM2, Docker, and Kubernetes for Java, Node.js, and Vue.js app CI/CD.",
          "Implemented DevOps workflows on Digital Ocean, speeding CI/CD process by 30%.",
          "Developed Chat, Live Stream, and Students Forum modules, resulting in a 50% increase in user engagement and communication, utilizing technologies such as webRTC, socket.io, Vue.js, and Kurento."
        ],
        "summary": "Developed tools for video and textual materials for students and a real-time messaging service for communication between students and teachers, improving the platform's front-end, making the platform more competitive with Coursera and Edx.",
        "location": "Kigali City, Rwanda"
      }

    ],
    "volunteer": [
      {
        "organization": "Future Skills Bootcamp",
        "position": "Web Development Mentor",
        "startDate": "2019-12-31",
        "endDate": "2019-12-31",
        "highlights": [
          "Covered five skills including HTML, CSS, Javascript, PHP, and SQL.",
          "Guided and facilitated students in presenting final projects on demo day.",
          "Facilitated students in designing web pages within 7 days, helping to foster competitive programming and creative thinking skills."


        ],
        "summary": "Taught programming concepts to 60 high school students during a two-week intensive bootcamp program.",
        "url": "https://www.minict.gov.rw/news-detail/minict-launches-the-second-edition-of-coding-bootcamp",
        "location": "Kigali, Kigali City, Rwanda"
      }
    ],
    "education": [
      {
        "institution": "Rwanda Coding Academy",
        "area": "Software Programming & Embedded System",
        "studyType": "Associate's degree",
        "startDate": "2019-02",
        "endDate": "2022-02",
        "courses": []
      },
      {
        "institution": "African Leadership University",
        "area": "Software Engineering",
        "startDate": "2023-09",
        "endDate": "2027-09",
        "studyType": "Bachelor's degree",
        "courses": []
      }
    ],
    "awards": [{
      "title": "AI hackathon Winner",
      "date": "2024-09-29",
      "awarder": "Irembo",
      "summary": "Our AI project, dubbed Bwenge, was ranked first among 18 projects reviewed by the judges in the 48-hour competition on September 29, 2024"
    },
    {
      "title": "NASA Space App Challenge Winner",
      "date": "2021-10-31",
      "url":"https://drive.google.com/file/d/1qqS1GiLFOUmcCGzAxq-QqUraLeLskUfW/view?usp=sharing",
      "awarder": "NASA - National Aeronautics and Space Administration",
      "summary": "Won first place in the NASA Space Apps Challenge Hackathon - Rwanda National Level"
    }],
    "certificates": [
      {
        "name": "Full Stack Observability Practitioner Exam",
        "issuer": "New Relic",
        "startDate": "2024-09",
        "endDate": "2026-09"
      },
      {
        "name": "New Relic Observability Practitioner Badge",
        "issuer": "New Relic",
        "startDate": "2024-09",
        "endDate": "2026-09"
      },
      {
        "name": "Responsive Web Design",
        "issuer": "freeCodeCamp",
        "startDate": "2021-07-31"
      },
      {
        "name": "JavaScript Algorithms and Data Structures",
        "issuer": "freeCodeCamp",
        "startDate": "2021-07-31"
      },
      {
        "name": "Scrum: The Basics",
        "issuer": "Linkedin Learning App",
        "startDate": "2022-08-31"
      },
      {
        "name": "Galactic Problem Solver",
        "issuer": "NASA - National Aeronautics and Space Administration",
        "startDate": "2021-10-31"
      }
    ],
    "publications": [],
    "skills": [
      {
        "name": "Languages & Frameworks",
        "keywords": [
          "TypeScript", "Node.js", "Vue.js", "React.js", "Spring Boot", "Nest.js", "Golang"
        ]
      },
      {
        "name":"Databases",
        "keywords": [
          "Clickhouse", "MongoDB", "PostgreSQL"        ]
      },
      {
        "name": "Cloud & DevOps",
        "keywords": [
          "Docker", "Kubernetes", "Gitlab CI/CD", "GCP", "AWS"
        ]
      },
      {
        "name":"Methodologies & Practices",
        "keywords": [
          "Agile/Scrum", "Atomic Design", "TDD", "Microservices"
        ]
      }
    ],
    "languages": [
      {
        "language": "English"
      }
    ],
    "interests": [],
    "references": [],
    "projects": [],
    "meta": {
      "version": "v1.0.0",
      "theme": "macchiato",
      "canonical": "https://github.com/jsonresume/resume-schema/blob/v1.0.0/schema.json"
    }
  }
